In [14]:
import pandas as pd

### Load dataset

In [15]:
data_mahasiswa = pd.read_csv('dataset_mahasiswa.csv', sep=";")

In [16]:
data_mahasiswa

   id_mahasiswa     nama_mahasiswa
0       9081111       Deny Wahyudi
1       9081112       Joko Sasonto
2       9081113  Bambang Pamungkas
3       9081114       Rudy Hartono
4       9081115           Adi Adam

In [17]:
data_mahasiswa['nilai_mahasiswa'] = ''

In [18]:
data_mahasiswa

   id_mahasiswa     nama_mahasiswa nilai_mahasiswa
0       9081111       Deny Wahyudi
1       9081112       Joko Sasonto
2       9081113  Bambang Pamungkas
3       9081114       Rudy Hartono
4       9081115           Adi Adam

In [19]:
data_nilai_mahasiswa = pd.read_csv('dataset_nilai.csv', sep=";")

In [20]:
data_nilai_mahasiswa

   id_mahasiswa  nilai_mahasiswa
0       9081111               80
1       9081112               90
2       9081113               95
3       9081114               75
4       9081115               65

### Join Code

In [21]:
def join_frame(data1, data1_key, data1_column_to_fill, data2, data2_key, data2_column):

    for index, row in data1.iterrows():
        data1.loc[index, data1_column_to_fill] = data2[(data2[data2_key] == row[data1_key])][data2_column].iloc[0]
        
    return data1

In [24]:
result = join_frame(data_mahasiswa, 'id_mahasiswa', 'nilai_mahasiswa', data_nilai_mahasiswa, 'id_mahasiswa', 'nilai_mahasiswa')

In [25]:
result

   id_mahasiswa     nama_mahasiswa  nilai_mahasiswa
0       9081111       Deny Wahyudi               80
1       9081112       Joko Sasonto               90
2       9081113  Bambang Pamungkas               95
3       9081114       Rudy Hartono               75
4       9081115           Adi Adam               65

### Save to CSV

In [ ]:
result.to_csv('result.csv', index=False)